import numpy as np

class USB_Camera(object):
    def __init__(self):
        # 左相机内参 及 畸变系数
        self.cam_matrix_left = np.array([[3.13229149e+03, 0., 1.38078252e+03], [0., 3.11524597e+03, 1.25386237e+03],[0.,0.,1.]])
        self.distortion_l = np.array([[0.04632877,0.13619159 -0.0259212,0.00131995,0.72588067]])
        # 右相机内参 及 畸变系数
        self.cam_matrix_right = np.array([[3.13229149e+03, 0., 1.38078252e+03], [0., 3.11524597e+03, 1.25386237e+03],[0.,0.,1.]])
        self.distortion_r = np.array([[0.04632877,0.13619159 -0.0259212,0.00131995,0.72588067]])
        # 右边相机相对于左边相机的 旋转矩阵 R ， 平移矩阵 T
        self.R = np.array([[-0.12457855,0.55740936,1.45932657],[-0.22254491,0.22353666,1.54739114],[-0.26796606,0.28112163,1.40420244]])
        self.T = np.array([[0.33893774],[-0.74742073],[2.75119175]])
        # 焦距
        self.focal_length = 6.00
        # 左右相机之间的距离 取 T 向量的第一维数值 单位 mm
        self.baseline = np.abs(self.T[0])




